[{"id":"1128627","title":"Senior DevOps Engineer","company":"Loka, Inc","url":"https://remoteok.com/remote-jobs/remote-senior-devops-engineer-loka-inc-1128627","location":"LatAm, North Macedonia, Portugal, Serbia","posted_date":"2025-10-28T14:00:19+00:00","description":"At Loka we use a modern tech stack to support meaningful projects across a huge range of industries. In the last year our teams have helped clients advance the world’s #1 GenAI reading tutor, eliminate $1B in food waste and develop novel drugs for fighting cancer, all while enjoying every other Friday off. Join us, feed your need to grow and ship projects you believe in with a team you’re proud to be a part of.\n\nAs Loka’s Senior DevOps Engineer, you'll be the go-to specialist for crafting and deploying infrastructure across a variety of projects. Your skills in AWS, TypeScript and Python will allow us to build solid, scalable systems and improve them over time. Ultimately we expect you to not only to fit in with the team but to elevate it to new heights.\n\nThe Role\n\n- Develop technical design specifications based on functional requirements and develop and maintain AWS Cloud applications.\n- Orchestrate containers with Kubernetes.\n- Automate operations, implement CI/CD pipelines.\n- Ensure security and compliance.\n- Assess change implementation options, benefits and risks and recommend the most appropriate approach with minimal assistance.\n\nRequired Hard Skills\n\n- 4+ years as Dev","tags":"design, security, python, technical, support, devops, serverless, cloud, typescript, senior, engineer, digital nomad","salary":"$120000","source":"RemoteOK","scraped_at":"2025-10-29T18:30:29.427Z","status":"new","match_score":null,"applied":false},{"id":"1128614","title":"Senior Mobile Growth Consultant ASO & CRO","company":"Phiture","url":"https://remoteok.com/remote-jobs/remote-senior-mobile-growth-consultant-aso-cro-phiture-1128614","location":"California","posted_date":"2025-10-27T16:01:02+00:00","description":"Hi, we’re Phiture — the mobile growth consultancy working with the teams behind leading apps like Adobe, Headspace, and LEGO® 👋. We’re setting the standard for growth in the brave new digital world, and we need great people to join our global team!\n\nWe're looking for a seasoned Growth Consultant to assume a pivotal position within Phiture, reporting directly to the Growth Lead and working closely with our key U.S.-based clients. You’ll play a pivotal role across app store optimization (ASO) and the entire user acquisition (UA) funnel, driving measurable growth for world-class mobile apps. You’ll lead projects that range from ASO-only engagements to integrated performance growth initiatives, connecting creative testing, data insights, and experimentation. This is a high-impact role for an experienced, hands-on marketer who combines analytical precision with strong strategic thinking and can confidently advise clients at a senior level.\n\nPlease note: As we're building our presence in the US, this role will play a pivotal part in our strategic expansion. While many of our roles offer flexibility in location, for this position, we're prioritizing candidates who are based ","tags":"consultant, growth, consultancy, mobile, lead, senior, operations, marketer","salary":"Not specified","source":"RemoteOK","scraped_at":"2025-10-29T18:30:29.428Z","status":"new","match_score":null,"applied":false},{"id":"1128610","title":"Logistics Analyst II","company":"PingWind","url":"https://remoteok.com/remote-jobs/remote-logistics-analyst-ii-pingwind-1128610","location":"Multiple Locations","posted_date":"2025-10-27T14:00:21+00:00","description":"<p><b>Location: </b>Multiple Locations&nbsp;</p><p><b>Required Clearance:</b> Public Trust</p><p><b>Certifications:</b> None</p><p><b>Required Education: </b>High School/GED</p><p><b>Required Experience:</b> 2-5 years experienced in logistics, transportation, or supply chain operations.</p><p><br></p><p><b>Position Description</b></p><p><br></p><p>PingWind is seeking Logistics Analyst II to serve as an experienced logistics professional responsible for analyzing, developing, and optimizing supply chain operations to improve efficiency, reduce costs, and ensure the timely delivery of goods and services. This role involves coordinating with internal departments, suppliers, and transportation partners while leveraging data analysis and logistics systems to enhance overall supply chain performance. The incumbent works under limited supervision and may provide guidance to junior analysts or logistics staff.</p><p><br></p><p><b>Primary Responsibilities</b></p><p><br></p><p>Typical Responsibilities/Tasks:</p><p>• Analyze end-to-end logistics operations to identify cost reduction, service improvement, and process optimization opportunities.</p><p>• Monitor key performance indicators (K","tags":"analyst, design, system, support, financial, education, management, junior, operations, operational, health, digital nomad","salary":"Not specified","source":"RemoteOK","scraped_at":"2025-10-29T18:30:29.428Z","status":"new","match_score":null,"applied":false},{"id":"1128596","title":"Operations Lead—AI Powered Quoting Content Communications","company":"Ascent Yard Care","url":"https://remoteok.com/remote-jobs/remote-operations-lead-ai-powered-quoting-content-communications-ascent-yard-care-1128596","location":"Remote","posted_date":"2025-10-25T13:33:05+00:00","description":"<p class=\"p1\"><span class=\"s1\">Company: Ascent Yard Care</span></p><p class=\"p1\"><span class=\"s1\">Compensation: $3,350.00 USD monthly. Paid via Wise. Pay raises and bonuses for top performers.</span></p><p class=\"p1\"><span class=\"s1\">Time zone: PST with 3–4 hours daily overlap Monday to Friday, async for the rest</span></p><p class=\"p1\"><span class=\"s1\">Contract: Full-time contractor</span></p><p class=\"p1\"><span class=\"s1\">TO APPLY: Read the entire job posting, complete the test project and submit the test project.</span></p><p class=\"p1\"><span class=\"s1\"> </span></p><p class=\"p1\"><span class=\"s1\">Mission</span></p><p class=\"p1\"><span class=\"s1\">Ascent Yard Care is restoring balance to British Columbia’s ecosystems by eradicating the invasive species that threaten our planet’s biodiversity.</span></p><p class=\"p1\"><span class=\"s1\">We are building the most advanced field operation in Canada to eliminate invasive species and regenerate natural ecosystems at scale.</span></p><p class=\"p1\"><span class=\"s1\">We’re not hiring an assistant. We’re hiring an operator. </span>Ascent has built an operational machine using AI, automation, and design thinking to revolutionize how lan","tags":"marketing, sales, ops, exec","salary":"$50000","source":"RemoteOK","scraped_at":"2025-10-29T18:30:29.428Z","status":"new","match_score":null,"applied":false},{"id":"1128589","title":"Director Demand Generation US","company":"Seamless.AI","url":"https://remoteok.com/remote-jobs/remote-director-demand-generation-us-seamless-ai-1128589","location":"United States","posted_date":"2025-10-24T16:00:39+00:00","description":"<h2><strong><img style=\"max-width: 100%;\" src=\"https://seamlessai-public.s3.us-east-2.amazonaws.com/Paid+Media/2023-10_Greenhouse_Awards-Banner_CI.webp\" alt=\"\" width=\"600\"></strong></h2>\n<h2><span style=\"color: #0065f2;\"><strong>The Opportunity</strong></span></h2>\n<p>Seamless.AI is seeking a data-driven, strategic, and execution-focused<strong> </strong>Director, Demand Generation to own and scale our customer acquisition engine. In this role, you will lead the strategy and execution of programs that drive pipeline, accelerate sales cycles, and deliver predictable revenue growth.</p>\n<p>You’ll work cross-functionally with our revenue team to create integrated campaigns that fuel our funnel from awareness through close.</p>\n<h2><span style=\"color: rgb(0, 101, 242);\"><strong>Responsibilities</strong></span></h2>\n<ul>\n<li>Own the strategy, execution, and performance of all marketing campaigns to drive users, demos and revenue across the customer lifecycle&nbsp;</li>\n<li>Oversee all lifecycle and nurture email campaigns across marketing and sales funnels</li>\n<li>Drive segmentation, lead scoring, and behavioral-based automation</li>\n<li>Collaborate with sales/ops on routing, MQL opt","tags":"director, saas, growth, strategy, lead, marketing, sales","salary":"Not specified","source":"RemoteOK","scraped_at":"2025-10-29T18:30:29.428Z","status":"new","match_score":null,"applied":false},{"id":"1128584","title":"Software Engineer","company":"Tech Innovations Inc.","url":"https://remoteok.com/remote-jobs/remote-software-engineer-tech-innovations-inc-1128584","location":"San Francisco","posted_date":"2025-10-24T11:00:05+00:00","description":"We are looking for a Software Engineer to join our team. You will be responsible for developing high-quality software solutions. Your duties will include designing, coding, testing, and maintaining software applications. You will work closely with other engineers and product managers to deliver innovative solutions. \n\nResponsibilities:\n- Develop and maintain software applications\n- Collaborate with cross-functional teams\n- Participate in code reviews\n- Troubleshoot and debug applications\n\nQualifications:\n- Bachelor's degree in Computer Science or related field\n- 3+ years of experience in software development\n- Proficiency in Java, Python, or C++\n- Strong problem-solving skills\n\nWe offer competitive salaries and benefits.<br/><br/>Please mention the word **PROFICIENTLY** and tag RMTIyLjE2OC42OC4yMDY= when applying to show you read the job post completely (#RMTIyLjE2OC42OC4yMDY=). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.","tags":"software, code, engineer","salary":"$120000","source":"RemoteOK","scraped_at":"2025-10-29T18:30:29.429Z","status":"new","match_score":null,"applied":false},{"id":"1128571","title":"Senior Data Engineer","company":"3Pillar","url":"https://remoteok.com/remote-jobs/remote-senior-data-engineer-3pillar-1128571","location":"Mexico","posted_date":"2025-10-24T00:02:42+00:00","description":"<p>🌟 Accomplished Tech Visionary:&nbsp;</p><p><br></p><p>Embark on an exciting journey into the realm of software development with 3Pillar! We extend an invitation for you to join our team and gear up for a thrilling adventure. At 3Pillar, our focus is on leveraging cutting-edge technologies that revolutionize industries by enabling data driven decision making. As a Senior Data Engineer, you will hold a crucial position within our dynamic team, actively contributing to thrilling projects that reshape data analytics for our clients, providing them with a competitive advantage in their respective industries.</p><p><br></p><p>If your passion for data analytics solutions that make a real-world impact, consider this your pass to the captivating world of Data Science and Engineering! 🔮🌐</p>\\n<p></p><p><br></p><b>Key Responsibilities</b><ul><li>Understanding the business requirements</li><li>Writing code and implementing the proposed solutions</li><li>Creating data pipelines, versioning and change management</li><li>Manage the complexity inherent in versioned data pipelines</li><li>Develop ETL/ELT processes to help extract and manipulate data from multiple sources.</li><li>Design","tags":"python, software, growth, code, java, cloud, nosql, management, senior, junior, analytics, health, engineer, engineering","salary":"Not specified","source":"RemoteOK","scraped_at":"2025-10-29T18:30:29.431Z","status":"new","match_score":null,"applied":false},{"id":"1128570","title":"Director Finance Strategy &amp; Operations","company":"HighLevel","url":"https://remoteok.com/remote-jobs/remote-director-finance-strategy-amp-operations-highlevel-1128570","location":"United States","posted_date":"2025-10-24T00:02:31+00:00","description":"<p><b style=\"font-size: 18px;\">About Us</b></p><p>HighLevel is an AI powered, all-in-one white-label sales &amp; marketing platform that empowers agencies, entrepreneurs, and businesses to elevate their digital presence and drive growth. We are proud to support a global and growing community of over 2 million businesses, comprised of agencies, consultants, and businesses of all sizes and industries. HighLevel empowers users&nbsp; with all the tools needed to capture, nurture, and close new leads into repeat customers. As of mid 2025, HighLevel processes over 4 billion API hits and handles more than 2.5 billion message events every day. Our platform manages over 470 terabytes of data distributed across five databases, operates with a network of over 250 microservices, and supports over 1 million hostnames.</p><p><br></p><p><b style=\"font-size: 18px;\">Our People</b></p><p>With over 1,500 team members across 15+ countries, we operate in a global, remote-first environment. We are building more than software; we are building a global community rooted in creativity, collaboration, and impact. We take pride in cultivating a culture where innovation thrives, ideas are celebrated, and peopl","tags":"director, design, saas, architect, cfo, support, accounting, financial, investor, finance, api, strategy, management, lead, operations, operational, marketing, legal, sales, executive, digital nomad","salary":"Not specified","source":"RemoteOK","scraped_at":"2025-10-29T18:30:29.431Z","status":"new","match_score":null,"applied":false},{"id":"1128565","title":"Autonomy Software Engineer Integration","company":"Glydways","url":"https://remoteok.com/remote-jobs/remote-autonomy-software-engineer-integration-glydways-1128565","location":"Remote","posted_date":"2025-10-24T00:01:33+00:00","description":"<p><strong>Who we are:</strong></p>\n<p>Glydways is reimagining what public transit can be. We believe that mobility is the gateway to opportunity—connecting people to housing, education, employment, commerce, and care. By making transportation more accessible, affordable, and sustainable, we empower communities to thrive and unlock economic and social prosperity.</p>\n<p>Our mission is to revolutionize transit with a solution that delivers high capacity, exceptional user experiences, unmatched affordability, and minimal environmental impact.</p>\n<p>The Glydways system is a groundbreaking network of carbon-neutral, interconnected transit pathways powered by standardized autonomous vehicles on dedicated roadways. Operating 24/7 with on-demand access, it offers personalized and efficient mobility—without the burden of heavy upfront infrastructure costs or ongoing taxpayer subsidies.</p>\n<p>With Glydways, we’re building more than a transportation system; we’re creating a future where everyone, everywhere, has the freedom to move.</p>\n<div><p><strong>Meet the team:</strong></p>\n<p>As a part of the larger Autonomy Team, the Autonomy Integration group is responsible for the high le","tags":"software, design, system, support, testing, c++, engineer, digital nomad","salary":"Not specified","source":"RemoteOK","scraped_at":"2025-10-29T18:30:29.431Z","status":"new","match_score":null,"applied":false},{"id":"1128563","title":"Full Stack Developer","company":"Bisnow","url":"https://remoteok.com/remote-jobs/remote-full-stack-developer-bisnow-1128563","location":"Remote","posted_date":"2025-10-24T00:01:03+00:00","description":"<p><i style=\"font-size: 16px\">Do you get excited about using automation and AI to solve problems, streamline workflows, and build smarter systems? We’re looking for a Software Developer who thrives on collaboration, innovation, and creating real business impact. At Bisnow, you’ll join a distributed development team building everything from web stack features to data pipelines and consumer-facing products.</i></p><p><br></p><p><i style=\"font-size: 16px\">In this role, you won’t just write high-quality code, you’ll also play a key part in translating complex technical requirements into clear, actionable solutions for non-technical partners across the business. We’re looking for someone who brings both front-end and back-end expertise, creativity in problem solving, and the ability to connect the dots between tech and people.</i></p><p><br></p><p><b style=\"font-size: 16px\">BISNOW OVERVIEW</b></p><p><br></p><p><span style=\"font-size: 16px\">Bisnow is the commercial real estate industry's leading, vertically integrated B2B media platform, covering North America, Canada, the UK and Ireland.&nbsp; We serve the CRE industry through award-winning news and publications, renowned even","tags":"developer, design, front-end, back-end, technical, software, code, web, marketing, sales, go, recruitment, digital nomad","salary":"Not specified","source":"RemoteOK","scraped_at":"2025-10-29T18:30:29.431Z","status":"new","match_score":null,"applied":false},{"id":"1128540","title":"Head of Platform Engineering","company":"Ethena Labs","url":"https://remoteok.com/remote-jobs/remote-head-of-platform-engineering-ethena-labs-1128540","location":"Globally Remote","posted_date":"2025-10-23T14:00:02+00:00","description":"<p><b style=\"font-size: 18px\">Who We Are and What We are Doing:</b></p><p>Ethena Labs is actively building and deploying a suite of groundbreaking digital dollar products aiming to upgrade money into the internet era.</p><p><br></p><p>Our flagship product, USDe, is a synthetic dollar backed by digital assets, and takes the novel approach of using a delta-neutral hedged basis strategy to maintain its peg. This product scaled from zero to $15b in 18 months.</p><p><br></p><p>Expanding on this, iUSDe is designed specifically for traditional financial institutions, incorporating necessary compliance features to enable them to access the crypto-native rewards our protocol generates, in an institutional-friendly manner.</p><p><br></p><p>Ethena has also developed USDtb: a fiat backed GENIUS compliant stablecoin in partnership with BlackRock which has scaled to ~$2b.</p><p><br></p><p>These products are also offered in a whitelabel stablecoin offering where any application, chain, wallet or exchange can launch their own stablecoin on Ethena's back-end infrastructure.</p><p><br></p><p>Through these offerings, Ethena Labs is not just creating new financial products; we are building the foundat","tags":"design, crypto, cryptocurrency, back-end, security, technical, support, developer, growth, devops, financial, finance, cloud, leader, strategy, lead, senior, operations, engineer, engineering, digital nomad","salary":"Not specified","source":"RemoteOK","scraped_at":"2025-10-29T18:30:29.431Z","status":"new","match_score":null,"applied":false},{"id":"1128536","title":"Job 25443 Senior Quality Assurance Automation Brazil","company":"CI&amp;T","url":"https://remoteok.com/remote-jobs/remote-job-25443-senior-quality-assurance-automation-brazil-ciampt-1128536","location":"Brazil","posted_date":"2025-10-23T00:04:44+00:00","description":"<p><span style=\"font-size: 16px\">Somos especialistas em <b>transformação tecnológica</b>, unindo expertise humana à IA para criar soluções tech escaláveis. Com mais de </span><a href=\"http://6.500\"><span style=\"font-size: 16px\">7</span></a>.400<span style=\"font-size: 16px\"> CI&amp;Ters ao redor do mundo, já formamos parcerias com mais de </span><a href=\"http://1.000\"><span style=\"font-size: 16px\">1.000</span></a><span style=\"font-size: 16px\"> clientes durante nossos 30 anos de história. Inteligência Artificial é nossa realidade.</span></p><p><br></p><p><span style=\"font-size: 16px\"><b>Importante</b>: </span><span style=\"font-size: 16px;\">se você reside na Região Metropolitana de Campinas, sua presença nos escritórios da cidade será obrigatória, conforme a política de frequencia vigente.</span></p><p><br></p><p>Estamos em busca de uma<b>&nbsp;Pessoa Engenheira de Qualidade de Software Sênior (QA Automation)</b>&nbsp;para se juntar ao nosso time e atuar em um projeto inovador para um de nossos clientes líderes no&nbsp;setor bancário.</p><p><br></p><p>Se você é uma pessoa apoixonada por qualidade, automação e por garantir a melhor experiência para o usuário ","tags":"software, test, qa, git, senior","salary":"Not specified","source":"RemoteOK","scraped_at":"2025-10-29T18:30:29.431Z","status":"new","match_score":null,"applied":false},{"id":"1128535","title":"Job 25362 Tester Junior Brazil","company":"CI&amp;T","url":"https://remoteok.com/remote-jobs/remote-job-25362-tester-junior-brazil-ciampt-1128535","location":"Brazil","posted_date":"2025-10-23T00:04:37+00:00","description":"<p><span style=\"font-size: 16px\">We are <b>tech transformation </b>specialists, uniting human expertise with AI to create scalable tech solutions.</span></p><p><span style=\"font-size: 16px\">With over <a href=\"http://7.400\">7.400</a> CI&amp;Ters around the world, we’ve built partnerships with more than 1,000 clients during our 30 years of history. Artificial Intelligence is our reality.</span></p><p><br></p><p>Hello there!</p><p><br></p><p>We are seeking a dynamic and detail-oriented <b>Junior Tester</b> who will play a crucial role in ensuring the quality of our web applications and API interfaces. The ideal candidate will possess a solid foundation in manual testing methodologies and a willingness to learn and adapt to automated testing tools. This role requires strong analytical and problem-solving skills, excellent communication abilities, and the capacity to thrive in an Agile environment.</p><p><br></p><p><b>Qualifications:</b></p><p><br></p><p>Experience: Familiarity with web applications and API testing.</p><p>Testing Methodologies: Strong understanding of manual testing strategies and test case design techniques.</p><p>Automated Testing Tools: Knowledge with automation to","tags":"tester, design, security, support, software, testing, test, web, cloud, api, junior, health, digital nomad","salary":"Not specified","source":"RemoteOK","scraped_at":"2025-10-29T18:30:29.431Z","status":"new","match_score":null,"applied":false},{"id":"1128528","title":"Talent &amp; People Ops Manager","company":"Mongoose","url":"https://remoteok.com/remote-jobs/remote-talent-amp-people-ops-manager-mongoose-1128528","location":"Remote","posted_date":"2025-10-23T00:02:26+00:00","description":"<p><span style=\"font-size: 10.5pt;\">At Mongoose, we believe every conversation matters.</span></p><p><br></p><p><span style=\"font-size: 10.5pt;\">We’re on a mission to change lives by making conversation intelligence accessible to all in higher education. Our purpose? To move people forward. Whether it’s helping a student navigate their first semester, connecting alumni with meaningful opportunities, or ensuring parents feel informed and supported—our AI-enabled platform drives compliant, empathetic, and impactful conversations that build trust and foster success campus-wide.</span></p><p><br></p><p><span style=\"font-size: 10.5pt;\">We know that conversations aren’t just a feature—they’re the foundation of connection. That’s why we focus on delivering insights, relevance, empathy, scale, and trust in everything we do. At Mongoose, we’re transforming communication in higher ed because we believe reputation is a mutual responsibility, and the right insights fuel measurable outcomes.</span></p><p><br></p><p><span style=\"font-size: 10.5pt;\">Join us and be part of a team that’s making a real difference in education—one conversation at a time.</span></p><p><br></p><p><s","tags":"manager, design, saas, hr, support, growth, education, strategy, operations, operational, recruiting, engineering, digital nomad","salary":"Not specified","source":"RemoteOK","scraped_at":"2025-10-29T18:30:29.431Z","status":"new","match_score":null,"applied":false},{"id":"1128527","title":"Account Executive North America New Logo","company":"Cyara","url":"https://remoteok.com/remote-jobs/remote-account-executive-north-america-new-logo-cyara-1128527","location":"United States","posted_date":"2025-10-23T00:02:19+00:00","description":"<p><span style=\"font-size: 11pt\">Cyara is the world’s leading Automated CX Assurance Platform provider, helping leading brands across the globe deliver better CX with less effort, cost, and risk. Cyara supports the entire CX software development lifecycle, from design to functional and regression testing, load testing, chatbot testing, and production monitoring, ensuring enterprises can build flawless customer journeys across voice and digital channels while reducing the risk of customer-facing defects. Every day, the most recognizable brands across the globe trust Cyara to deliver customer smiles at scale.&nbsp;&nbsp;Interested to find out more about us?&nbsp; Check out:&nbsp;&nbsp;</span><a class=\"postings-link\" style=\"font-size: 11pt\" href=\"http://www.cyara.com/\">www.cyara.com</a><span style=\"font-size: 11pt\">&nbsp;</span></p><p><br></p><p><br></p><p><b style=\"font-size: 12pt\">Cyara’s Diversity, Equity, Inclusive and Belonging Statement:</b><span style=\"font-size: 12pt\">&nbsp;</span></p><p><span style=\"font-size: 11pt\">At Cyara, we are dedicated to fostering a workplace that embodies equal opportunity and champions diversity, equity, inclusion, and belonging (DEIB). We striv","tags":"design, saas, software, growth, voice, chatbot, management, lead, senior, sales, executive, digital nomad","salary":"Not specified","source":"RemoteOK","scraped_at":"2025-10-29T18:30:29.431Z","status":"new","match_score":null,"applied":false},{"id":"1128518","title":"BUSINESS DEVELOPMENT DIRECTOR","company":"Wishpond Technologies","url":"https://remoteok.com/remote-jobs/remote-business-development-director-wishpond-technologies-1128518","location":"Philippines","posted_date":"2025-10-23T00:00:10+00:00","description":"<p><b style=\"font-size: 18px;\">Wishpond Technologies currently has the position of&nbsp;Business Development Director&nbsp;available, and we’re excited to tell you about it!</b></p><p><span style=\"font-size: 22px;\">&nbsp;</span></p><p><b style=\"font-size: 24px;\">OVERVIEW</b></p><p><span style=\"font-size: 16px;\">We are looking for a&nbsp;Business Development Director, a visionary leader with a sharp strategic mind and the drive to transform data, people, and processes into growth,&nbsp;to join our team on a full-time basis.&nbsp; This is a fully remote position, and the successful individual could be based anywhere in the world</span><b style=\"font-size: 16px;\">. </b><span style=\"font-size: 16px;\">You will work with an amazing remote team servicing and building&nbsp;relationships with&nbsp;clients primarily based in the US and Canada,&nbsp;in collaboration with the Sales team and all departments.</span></p><p><br></p><p><span style=\"font-size: 16px;\">The </span><b style=\"font-size: 16px;\">Business Development Director</b><span style=\"font-size: 16px;\"> is a strategic and data-driven leader responsible for overseeing and optimizing the performance of the Business Development, Lead ","tags":"director, design, saas, training, support, software, growth, education, leader, management, lead, senior, operations, operational, marketing, sales, executive, full-time, digital nomad","salary":"Not specified","source":"RemoteOK","scraped_at":"2025-10-29T18:30:29.432Z","status":"new","match_score":null,"applied":false},{"id":"1128514","title":"Quality Assurance Analyst","company":"Carrot","url":"https://remoteok.com/remote-jobs/remote-quality-assurance-analyst-carrot-1128514","location":"Remote","posted_date":"2025-10-22T20:00:22+00:00","description":"<p><strong>About Carrot:</strong></p>\n<p><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=4420559-1&amp;h=3535232987&amp;u=https%3A%2F%2Fwww.carrotfertility.com%2F&amp;a=Carrot+Fertility\">Carrot</a> is a global, comprehensive fertility and family care platform, supporting members and their families through many of life's most memorable moments. Trusted by many of the world’s leading multinational employers, health plans, and health systems, Carrot’s proven clinical program delivers exceptional outcomes and experiences for members and industry-leading cost-savings for employers. Its award-winning products serve all populations, from preconception care through pregnancy, IVF, male factor infertility, adoption, gestational carrier care, and menopause. Carrot offers localized support in over 170 countries and 25 languages. With a comprehensive program that prioritizes clinical excellence and human-centered care, Carrot supports members and their families through many of the most meaningful moments of their lives. Learn more at <a href=\"http://get-carrot.com\">get-carrot.com</a>.</p>\n<div><p><strong>The Role:&nbsp;</strong></p>\n<p>We are adding a role to our Operations team to fu","tags":"analyst, system, support, qa, senior, operations, health","salary":"Not specified","source":"RemoteOK","scraped_at":"2025-10-29T18:30:29.432Z","status":"new","match_score":null,"applied":false},{"id":"1128513","title":"Growth Marketing Specialist","company":"PolicyMe","url":"https://remoteok.com/remote-jobs/remote-growth-marketing-specialist-policyme-1128513","location":"Remote in Toronto","posted_date":"2025-10-22T19:00:27+00:00","description":"<p><b>Overview of the Role</b></p><p>We’re on a mission to modernize insurance – making it simpler, more accessible, and customer-first. The insurance industry is a $1T market that’s remained largely untouched by the digital revolution, and PolicyMe is here to change that. As a remote-first, Toronto-based startup with big ambitions, we’re looking for a <b>Growth Marketing Specialist</b> to help us build the future of insurance in Canada – and beyond.</p><p><br></p><p>In this role, you’ll partner closely with our Director of Growth, to accelerate how we acquire customers across multiple channels. You’ll combine data-driven problem solving, creative strategy, and an entrepreneurial mindset to identify growth opportunities, run experiments, and scale what works. This is an ideal role for someone who thrives in ambiguity, learns fast, and wants to play a central role in shaping a fast-growing business.</p>\\n<p></p><p><br></p><b>What you'll be doing:</b><ul><li>Analyzing channel performance (Google, Facebook, and others) using Looker and other tools to ensure CAC and CPA thresholds are met.</li><li>Owning day-to-day paid media operations while developing the ability to unc","tags":"growth, support, director, financial, video, operations, marketing, health","salary":"Not specified","source":"RemoteOK","scraped_at":"2025-10-29T18:30:29.432Z","status":"new","match_score":null,"applied":false},{"id":"1128509","title":"Sr NGS Sales Specialist Boston","company":"Twist Bioscience","url":"https://remoteok.com/remote-jobs/remote-sr-ngs-sales-specialist-boston-twist-bioscience-1128509","location":"USA - Remote","posted_date":"2025-10-22T16:04:23+00:00","description":"The Next Generation Sequencing Sales Specialist is responsible for delivering revenue and driving growth in their territory for Twist Bioscience sequencing products. (S)he is accountable for delivering accurate revenue forecasts throughout the fiscal year, enabling the executive team to monitor business performance and drive decision making. (S)he is required to maintain knowledge of competitor products and their commercial strategies, identifying and escalating their activities in a time bound manner. (S)he is also accountable for providing customer feedback on Twist Bioscience products in addition to identifying unmet customer needs that will enable the development of new and innovative products.\n\nWhat You'll Be Doing:\n- Attain quarterly and annual revenue targets established from annual commission plans.\n- Deliver accurate and timely forecasts for their territory.\n- Develop and manage key relationships with new and existing customers at multiple organizational levels.\n- Develop contingency and risk mitigation plans for their region as necessary.\n- Develop and execute supply agreements to support new and existing business.\n- Work collaboratively with product management, R&D and o","tags":"technical, support, growth, financial, management, operations, sales, biology, executive","salary":"Not specified","source":"RemoteOK","scraped_at":"2025-10-29T18:30:29.432Z","status":"new","match_score":null,"applied":false},{"id":"1128508","title":"Senior Software Engineer","company":"Acquia","url":"https://remoteok.com/remote-jobs/remote-senior-software-engineer-acquia-1128508","location":"Pune or Delhi/NCR","posted_date":"2025-10-22T16:04:00+00:00","description":"<strong>Senior Software Engineer (Java/Python + Jenkins CI/CD)</strong>\n<p><strong>About Acquia</strong></p>\n<p>Acquia empowers the world’s most ambitious brands to create digital customer experiences that matter. With open source Drupal at its core, the Acquia Digital Experience Platform (DXP) enables marketers, developers, and IT operations teams at thousands of global organizations to rapidly compose and deploy digital products and services that engage customers, enhance conversions, and help businesses stand out.</p>\n<p>Headquartered in the U.S., Acquia is a Great Place to Work-CertifiedTM company in India, is listed as one of the world’s top software companies by The Software Report, and is positioned as a market leader by the analyst community. We are Acquia. We are building for the future and we want you to be a part of it!</p>\n<p>Acquia is seeking a Senior Software Engineer with Java/Python, DevOps CI/CD and Kubernetes expertise who can help lead our efforts for developing, maintaining, monitoring and securing our Platform.&nbsp; As a Senior Engineer, you will be working on DevOps Continuous Integration and Delivery for a wide range of core services, tooling, and automa","tags":"software, system, support, analyst, scrum, devops, java, cloud, drupal, leader, lead, senior, operations, operational, engineer","salary":"Not specified","source":"RemoteOK","scraped_at":"2025-10-29T18:30:29.432Z","status":"new","match_score":null,"applied":false},{"id":"1128506","title":"Software Developer","company":"Higher Logic","url":"https://remoteok.com/remote-jobs/remote-software-developer-higher-logic-1128506","location":"CAN-Remote","posted_date":"2025-10-22T16:02:41+00:00","description":"The Software Developer plays an integral role in building and supporting Higher Logic’s robust SaaS applications. Performs coding, debugging, testing and troubleshooting through the application development process. As a part of an agile engineering team, our Software Developers produce high quality, scalable software components that support our customers initiatives worldwide.\n\nESSENTIAL DUTIES AND RESPONSIBILITES:\n\n· Maintain, modify, and improve Higher Logic’s current software solutions\n· Write reusable, testable, and efficient code\n· Participate in agile planning and review meetings\n· Contribute to peer code reviews and internal documentation generation\n· Support Product team members in ongoing planning and design\n· Conduct all business in accordance with Higher Logic policies and procedures.\n· All other duties as assigned.\n\nKNOWLEDGE AND ABILITIES REQUIRED:\n\n· Practical understanding of Object-oriented languages and development techniques and React.\n· Working understanding of relational database development such as SQL, MySQL or PostgreSQL.\n· Experience executing common design patterns (MVC, Singleton, Factory Methods, etc.).\n· Exposure to Webservice development ","tags":"developer, software, design, saas, support, testing, code, mysql, engineering, digital nomad","salary":"Not specified","source":"RemoteOK","scraped_at":"2025-10-29T18:30:29.432Z","status":"new","match_score":null,"applied":false}]